Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещенийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеПоЗаказам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеПодДеятельность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказНаПеремещение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НазначениеОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Собирается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//++ РС Консалт: Минаков А.С. Задача 20226
	Элементы.Товары.Подвал = Истина;
	Элементы.ТоварыКоличествоУпаковок.ПутьКДаннымПодвала = "Объект.Товары.ИтогКоличествоУпаковок";
	//++ РС Консалт: Минаков А.С. Задача 20226
	
	//РСК+ Кикинева А.Г. задача 256971
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ЗаполнитьТоварПоОстаткамСклада");
	НоваяКоманда.Действие = "ЗаполнитьТоварПоОстаткамСклада";
	НоваяКоманда.Заголовок = "Заполнить по остаткам";
	//Создаем Кнопку
	НоваяКнопка = ЭтаФорма.Элементы.Добавить("КнопкаВГруппеТовары", Тип("КнопкаФормы"),ЭтаФорма.Элементы.ТоварыГруппаЗаполнить);
	НоваяКнопка.ИмяКоманды = "ЗаполнитьТоварПоОстаткамСклада";    
	//РСК- Кикинева А.Г. задача 256971   
	
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	НовыйЭлементГруппа = Элементы.Добавить("ГруппаВес", Тип("ГруппаФормы"), Элементы.ГруппаИтого);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("РСК_Вес", Тип("ПолеФормы"), НовыйЭлементГруппа);	
	НовыйЭлемент.Заголовок = "Вес";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РСК_Вес";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлементГруппа = Элементы.Вставить("ГруппаОбъем", Тип("ГруппаФормы"), Элементы.ГруппаИтого, НовыйЭлементГруппа);
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("РСК_Кубатура", Тип("ПолеФормы"), НовыйЭлементГруппа);	
	НовыйЭлемент.Заголовок = "Объем";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РСК_Кубатура";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 12;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
	//--

КонецПроцедуры  

&НаСервере
Процедура РСК_РассчитатьВГХ() 
	
	ТаблицаТовары = Объект.Товары.Выгрузить(, "Номенклатура,Характеристика,Серия,КоличествоУпаковок,Упаковка"); 
	
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	Если ТаблицаТовары.Количество() Тогда
		ВГХПоказатели = РСК_ВызовСервера.РассчитатьВесогабаритныеХарактеристикиДокумента(ТаблицаТовары);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВГХПоказатели); 
	Иначе
		РСК_Вес      = "0";
		РСК_Кубатура = "0";
	КонецЕсли;
	//--
		
КонецПроцедуры

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура РСК_ПриЧтенииСозданииНаСервере()
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	РСК_РассчитатьВГХ();  
	//--
КонецПроцедуры

&НаКлиенте
Процедура РСК_ТоварыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	//++ Конарев И.И. Пересчет ВГХ по техническим характеристикам
	РСК_РассчитатьВГХ();   
	//--
КонецПроцедуры

&НаСервере
&После("ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу")
Процедура РСК_ОбновитьЗависимыеРеквизитыФормыСерверПоЗаказу()
	
	//++ РС Консалт: Минаков А.С. Задача 20226		
	Элементы.ТоварыНазначениеОтправителя.Доступность = Не Объект.ПеремещениеПоЗаказам
	//++ РС Консалт: Минаков А.С. Задача 20226
		
КонецПроцедуры

//РСК+ Кикинева А.Г. задача 256971 заполнение документа остатками по складу отправителю
&НаСервере
Функция ЗаполнитьТоварПоОстаткамСкладаСервер()
	
	Документ=РеквизитФормыВЗначение("Объект");  
	
	ЗапросТекст = "ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.Склад КАК Склад,
|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
|	ТоварыНаСкладахОстатки.Серия КАК Серия,
|	ВЫБОР
|		КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|				ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
|	КОНЕЦ КАК Количество,
|	ВЫБОР
|		КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|				ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|			ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток)
|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
|	КОНЕЦ КАК КоличествоУпаковок,
|	ВЫБОР
|		КОГДА НЕ ТоварыНаСкладахОстатки.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
|			ТОГДА 14
|	КОНЕЦ КАК СтатусУказанияСерий
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, &Склад = Склад) КАК ТоварыКОтгрузкеОстатки
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
|			И ТоварыНаСкладахОстатки.Характеристика = ТоварыКОтгрузкеОстатки.Характеристика
|			И ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
|ГДЕ
|	ВЫБОР
|			КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0
|					ИЛИ ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0
|				ТОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.ВРезервеОстаток) > 0
|			ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
|		КОНЕЦ
|
|УПОРЯДОЧИТЬ ПО
|	ТоварыНаСкладахОстатки.Номенклатура.Наименование,
|	ТоварыНаСкладахОстатки.Характеристика.Наименование";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;                                   
	Запрос.УстановитьПараметр("Дата", Документ.Дата);
	Запрос.УстановитьПараметр("Склад", Документ.СкладОтправитель);   
	
	Документ.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗначениеВРеквизитФормы(Документ, "Объект");

КонецФункции

&НаКлиенте
Процедура ОтветНаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТоварПоОстаткамСкладаСервер();	
		ОбновитьФорму= Новый Структура;
		ЭтаФорма.Записать(ОбновитьФорму);
	КонецЕсли;	     
	
	КонецПроцедуры

 &НаКлиенте
 Процедура ЗаполнитьТоварПоОстаткамСклада(Команда)   
	 
	 Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗавершение", ЭтотОбъект);
	 ТекстВопроса = "Табличная часть будет заполнена остатками на складе. Продолжить?";
	 ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	  
КонецПроцедуры

//РСК- Кикинева А.Г. задача 256971 заполнение документа остатками по складу отправителю
